Sark1tama/lwip-StatefulDHCPv6/GD32-Examples/2.2.0/Firmware/CMSIS/GD/GD32F4xx/Source/system_gd32f4xx(1).c
    /* select the high-drive mode */
    PMU_CTL |= PMU_CTL_HDS;
    while(0U == (PMU_CS & PMU_CS_HDSRF)){
    }

    /* select PLL as system clock */
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    RCU_CFG0 |= RCU_CKSYSSRC_PLLP;

    /* wait until PLL is selected as system clock */
    while(0U == (RCU_CFG0 & RCU_SCSS_PLLP)){
    }
}
#elif defined (__SYSTEM_CLOCK_150M_PLL_16M_HXTAL)
/*!
    \brief      configure the system clock to 160M by PLL which selects HXTAL(16M) as its clock source
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_150m_16m_hxtal(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;
    
    /* enable HXTAL */
    RCU_CTL |= RCU_CTL_HXTALEN;

    /* wait until HXTAL is stable or the startup time is longer than HXTAL_STARTUP_TIMEOUT */
    do{
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_HXTALSTB);
    }
    while((0U == stab_flag) && (HXTAL_STARTUP_TIMEOUT != timeout));

    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_HXTALSTB)){
      while(1){
      }
    }
         
    RCU_APB1EN |= RCU_APB1EN_PMUEN;
    PMU_CTL |= PMU_CTL_LDOVS;

    /* HXTAL is stable */
    /* AHB = SYSCLK */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
    /* APB2 = AHB/2 */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
    /* APB1 = AHB/4 */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

    /* Configure the main PLL, PLL_M = 16, PLL_N = 400, PLL_P = 2, PLL_Q = 9 */ 
    RCU_PLL = (16U | (300U << 6U) | (((2U >> 1U) - 1U) << 16U) |
                   (RCU_PLLSRC_HXTAL) | (9U << 24U));

    /* enable PLL */
    RCU_CTL |= RCU_CTL_PLLEN;

    /* wait until PLL is stable */
    while(0U == (RCU_CTL & RCU_CTL_PLLSTB)){
    }
    
    /* Enable the high-drive to extend the clock frequency to 200 Mhz */
    PMU_CTL |= PMU_CTL_HDEN;
    while(0U == (PMU_CS & PMU_CS_HDRF))
    {
    }
    
    /* select the high-drive mode */
    PMU_CTL |= PMU_CTL_HDS;
    while(0U == (PMU_CS & PMU_CS_HDSRF))
    {
    } 
    
    /* select PLL as system clock */
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    RCU_CFG0 |= RCU_CKSYSSRC_PLLP;

    /* wait until PLL is selected as system clock */
    while(0U == (RCU_CFG0 & RCU_SCSS_PLLP)){
    }
}

#elif defined (__SYSTEM_CLOCK_160M_PLL_16M_HXTAL)
/*!
    \brief      configure the system clock to 160M by PLL which selects HXTAL(16M) as its clock source
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_160m_16m_hxtal(void)
{
	uint32_t timeout = 0U;

	/* enable HXTAL */
	RCU_CTL |= RCU_CTL_HXTALEN;

	/* wait until HXTAL is stable or the startup time is longer than HXTAL_STARTUP_TIMEOUT */
	while((0U == (RCU_CTL & RCU_CTL_HXTALSTB)) && (HXTAL_STARTUP_TIMEOUT != timeout++)){
	}

	/* if fail */
	if(0U == (RCU_CTL & RCU_CTL_HXTALSTB)){
		while(1){
		}
	}

	RCU_APB1EN |= RCU_APB1EN_PMUEN;
	PMU_CTL |= PMU_CTL_LDOVS;
	/* HXTAL is stable */
	/* AHB = SYSCLK */
	RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;	// 160MHz
	/* APB2 = AHB/2 */
	RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;	// 80MHz
	/* APB1 = AHB/4 */
	RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;	// 40MHz

	/* Configure the main PLL, PLL_M = 16, PLL_N = 320, PLL_P = 2, PLL_Q = 7 */
	RCU_PLL = (16U | (320 << 6U) | (((2 >> 1U) -1U) << 16U) |
				   (RCU_PLLSRC_HXTAL) | (7 << 24U));

	/* enable PLL */
	RCU_CTL |= RCU_CTL_PLLEN;

	/* wait until PLL is stable */
	while(0U == (RCU_CTL & RCU_CTL_PLLSTB)){
	}

	/* Configure the PLLSAI,PLLSAIVCOSRC = PLLVCOSRC = 1MHz,PLLSAI_N = 96, PLLSAI_P = 2, PLLSAI_R = 6 */
//	RCU_PLLSAI = ((96 << 6U) | (((2 >> 1U) -1U) << 16U) |(6 << 28U));
//
//	/* enable PLLSAI */
//	RCU_CTL |= RCU_CTL_PLLSAIEN;
//
//	/* wait until PLLSAI is stable */
//	while(0U == (RCU_CTL & RCU_CTL_PLLSAISTB));
//
//	/* Configure the PLLI2S,PLLI2SVCOSRC = PLLVCOSRC = 1MHz,PLLI2S_N = 100,PLLI2S_R = 6 */
	// RCU_PLLI2S = ((100 << 6U) |(6 << 28U));
    // RCU_PLLI2S = ((100 << 6U) |(2 << 28U));
   RCU_PLLI2S = ((400 << 6U) |(4 << 28U)); // 100MHz
 //        RCU_PLLI2S = ((200 << 6U) |(2 << 28U)); // 100MHz
	/* enable PLLI2S */
	RCU_CTL |= RCU_CTL_PLLI2SEN;

	/* wait until PLLI2S is stable */
	while(0U == (RCU_CTL & RCU_CTL_PLLI2SSTB));

	/* Enable the high-drive to extend the clock frequency to 160 Mhz */
	PMU_CTL |= PMU_CTL_HDEN;
	while(0U == (PMU_CS & PMU_CS_HDRF)){
	}

	/* select the high-drive mode */
	PMU_CTL |= PMU_CTL_HDS;
	while(0U == (PMU_CS & PMU_CS_HDSRF)){
	}

	/* select PLL as system clock */
	RCU_CFG0 &= ~RCU_CFG0_SCS;
	RCU_CFG0 |= RCU_CKSYSSRC_PLLP;

	/* wait until PLL is selected as system clock */
	while(0U == (RCU_CFG0 & RCU_SCSS_PLLP)){
	}
}

#elif defined (__SYSTEM_CLOCK_160M_PLL_25M_HXTAL)
/*!
    \brief      configure the system clock to 168M by PLL which selects HXTAL(25M) as its clock source
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void system_clock_160m_25m_hxtal(void)
{
    uint32_t timeout = 0U;
    uint32_t stab_flag = 0U;

    /* enable HXTAL */
    RCU_CTL |= RCU_CTL_HXTALEN;

    /* wait until HXTAL is stable or the startup time is longer than HXTAL_STARTUP_TIMEOUT */
    do{
        timeout++;
        stab_flag = (RCU_CTL & RCU_CTL_HXTALSTB);
    }while((0U == stab_flag) && (HXTAL_STARTUP_TIMEOUT != timeout));

    /* if fail */
    if(0U == (RCU_CTL & RCU_CTL_HXTALSTB)){
        while(1){
        }
    }

    RCU_APB1EN |= RCU_APB1EN_PMUEN;
    PMU_CTL |= PMU_CTL_LDOVS;

    /* HXTAL is stable */
    /* AHB = SYSCLK */
    RCU_CFG0 |= RCU_AHB_CKSYS_DIV1;
    /* APB2 = AHB */
    RCU_CFG0 |= RCU_APB2_CKAHB_DIV2;
    /* APB1 = AHB */
    RCU_CFG0 |= RCU_APB1_CKAHB_DIV4;

    /* Configure the main PLL, PLL_M = 25, PLL_N = 320, PLL_P = 2, PLL_Q = 7 */
    RCU_PLL = (25U | (320U << 6U) | (((2U >> 1U) - 1U) << 16U) |
                   (RCU_PLLSRC_HXTAL) | (7U << 24U));

    /* enable PLL */
    RCU_CTL |= RCU_CTL_PLLEN;

    /* wait until PLL is stable */
    while(0U == (RCU_CTL & RCU_CTL_PLLSTB)){
    }

    /* Enable the high-drive to extend the clock frequency to 168 Mhz */
    PMU_CTL |= PMU_CTL_HDEN;
    while(0U == (PMU_CS & PMU_CS_HDRF)){
    }

